CSI API ETABS v1

# cAreaObjSetGroupAssign Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetGroupAssign(
    	string Name,
    	string GroupName,
    	bool Remove = false,
    	eItemType ItemType = eItemType.Objects
    )

    Function SetGroupAssign (
    	Name As String,
    	GroupName As String,
    	Optional Remove As Boolean = false,
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cAreaObj
    Dim Name As String
    Dim GroupName As String
    Dim Remove As Boolean
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.SetGroupAssign(Name,
    	GroupName, Remove, ItemType)

    int SetGroupAssign(
    	String^ Name,
    	String^ GroupName,
    	bool Remove = false,
    	eItemType ItemType = eItemType::Objects
    )

    abstract SetGroupAssign :
            Name : string *
            GroupName : string *
            ?Remove : bool *
            ?ItemType : eItemType
    (* Defaults:
            let _Remove = defaultArg Remove false
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString

GroupName

    Type: SystemString

Remove (Optional)

    Type: SystemBoolean

ItemType (Optional)

    Type: ETABSv1eItemType

#### Return Value

Type: Int32

See Also

#### Reference

cAreaObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com